Работа_с_формами_в_управляемом_интерфейсе/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ПрофилиПользователей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ЦенаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтроки</name>
      <type>
        <types>DefinedType.СуммаСтрокиДокумента</types>
      </type>
    </attributes>
    <attributes>
      <name>Отложить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Работа_с_формами_в_управляемом_интерфейсе/src/Documents/ЗаказКлиента/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения,
		СтандартнаяОбработка)

	Если (ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
			И ДанныеЗаполнения.Свойство("Состав") = Истина) Тогда
		Состав.Загрузить(ДанныеЗаполнения.Состав);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Условие = Новый Структура("Клиент", Клиент);

	Если (ПолучитьФункциональнуюОпцию("Резервирование", Условие) = Ложь) Тогда
		Состав.ЗагрузитьКолонку(Новый Массив(Состав.Количество()), "Отложить");
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКолонкуЦена() Экспорт
	Сообщить("Метод: ЗаполнитьКолонкуЦену отработал");
КонецПроцедуры
